{
  "/": {
    "title": "💻 MCC Computer Science Club",
    "content": "## Upcoming meeting March 2, 2022 @ 5pm MST.\n## [Join Here](https://tinyurl.com/CSCclubMeet)\n![Upcoming Meeting](MCC_COmputer_Science_Club.png)\n\n### [Notes from our last meeting](notes/personal-privacy-and-security.md)\n### [Read all past meetings](/notes)",
    "lastmodified": "2022-03-03T05:35:29.169900607Z",
    "tags": null
  },
  "/notes/personal-privacy-and-security": {
    "title": "Personal Privacy and Security",
    "content": "---\n## Why does it matter?\n### From [privacyguides.org](https://privacyguides.org):\n#### “I have nothing to hide. Why should I care about my privacy?”\n\n Much like the right to interracial marriage, woman's suffrage, freedom of speech, and many others, we didn't always have the right to privacy. In several dictatorships, many still don't. Generations before ours fought for our right to privacy. Privacy is a human right inherent to all of us that we are entitled to without discrimination.\n\n You shouldn't confuse privacy with secrecy. We know what happens in the bathroom, but you still close the door. That's because you want privacy, not secrecy. **Everyone** has something to hide, privacy is something that makes you human.\n\n### Some food for thought:\n\u003e You might not have anything to hide, but you have everything to protect.\n\n-Mikko Hyppönen\n\n\u003e Arguing that you don't care about the right to privacy because you have nothing to hide is no different than saying you don't care about free speech because you have nothing to say.\n\n-Edward Snowden\n\n### What do you have to protect?\nLocation data, medical records, credit card, pictures, notes, emails.....\n\nstalking could be a personal concern, government surviellence like ECHELON, FinCEN, [NSA Utah Data Center](https://en.wikipedia.org/wiki/Utah_Data_Center), companies can sell anything you give to them...\n\n![NSA Utah Data Center](/notes/images/Pastedimage20220302145304.png)\n\n## What is security and privacy?\nSecurity is about keeping unauthorized entities out (of your information), privacy is about who those people are.\n\n![Security vs Privacy infographic](/notes/images/securityVsPrivacy.png)\n## What is a threat model?\nA threat model identifies threats and defines countermeasures.\n\nA threat model is:\n- personal\n- not a black and white \"you are secure vs not secure\"\n- slow progress\n\nEveryone already does threat modeling, they just don't know there is a name for it or they're not aware that they're doing it.\n\nThreat modeling is not just for your digital assets, take this automotive threat model for example:\n![Pasted image 20220302161742.png](/notes/images/automotiveThreatModel.png)\n\u003cfigcaption\u003e\u003ca href=\"https://www.nccgroup.com/globalassets/newsroom/uk/blog/images/2016/07/th-cc-11.png\"\u003eSource\u003c/a\u003e\u003c/figcaption\u003e\n\n### From [ArsTechnica](https://arstechnica.com/information-technology/2017/07/how-i-learned-to-stop-worrying-mostly-and-love-my-threat-model/):\nTo identify what could happen to the things you value and determine from whom you need to protect them, you want to answer these five questions:\n\n1.  What do you want to protect? (The data, communications, and other things that could cause problems for you if misused.)\n2.  Who do you want to protect it from? (The people, organizations, and criminal actors who might seek access to that stuff.)\n3.  How likely is it that you will need to protect it? (Your personal level of exposure to those threats.)\n4.  How bad are the consequences if you fail?\n5.  How much trouble are you willing to go through in order to try to prevent those? (The money, time and convenience you're willing to dispense with to protect those things.)\n...\nOf course, some activities invite risk in and of themselves based on the kind of information being exposed. In the world of threat modeling, these are often referred to as \"**assets**\"—the important pieces of information you want to use in an activity but simultaneously want to protect:\n\n-   Credit card data: yours, or (if you sell stuff) a customer's.\n-   Banking data: account numbers, routing numbers, e-banking usernames and passwords.\n-   Personally identifying information: Social Security number, date of birth, income data, W-2s, passport numbers, drivers' license or national ID numbers.\n-   Intellectual property: like that treatment for an Ars action movie I've been working on.\n-   Sensitive personal or business information and communications: e-mails and texts that could be used to embarrass, blackmail, or imprison you.\n-   Politically sensitive information or activities that could get you in trouble with your employer, the government, law enforcement, or other interested parties.\n-   Travel plans that could be used to target you or others for fraud or other forms of attack.\n-   Other business or personal data that are financially or emotionally essential (family digital photos, for example).\n-   Your identity itself, if you are trying to stay anonymous online for your protection.\n\n### A basic threat model\nHere's a simple table to help you. Give each cell a value from 1-3 for importance, and a brief (5-10 words) description of your stance/concerns.\n\n|           | People | Companies | Governments |\n|",
    "lastmodified": "2022-03-03T05:35:29.19390068Z",
    "tags": null
  }
}