{
  "/": {
    "title": "💻 MCC Computer Science Club",
    "content": "# Upcoming meeting September 1, 2022 @ 4pm\n![Upcoming Meeting](MCC_Computer_Science_Club_Kickoff.png)\n\n# Meeting Schedule\n\n[View the calendar](https://urlsl.me/ghfka). You must be signed into your MCC email.\n\nIn general:\nEvery other week there is an in person meeting at 4pm. \nOn the off-weeks there is a more informal online meeting at 4pm.\n\n- Sept 1 - Kickoff event\n- Sept 9 - Leetcode (Friday meeting)\n- Sept 15 - Git meeting\n- Sept 29 - UNIX commands\n- Oct 7 - Git command line (Friday meeting)\n- Oct 13 - Tool assisted debugging\n- Oct 27 - Field trip\n- Nov 10 - Guest speaker\n- Dec 8 - Chill meeting\n\nPossible second guest speaker\n\n# [Join the discord](https://urlsl.me/ClubDiscord)\n\nWe post announcements, conduct Friday meetings, chat and share computer science memes here.\n\n# [Read some past meetings' notes](/notes)\n(Sometimes I forget to add them.)\n\n# [Club Constitution](https://docs.google.com/document/d/1lZO2jBUXkcTIfpte7BVjmC_MuQbltA7kBvud9YrpWcM/edit?usp=sharing)\nSign into your MCC email.",
    "lastmodified": "2022-09-01T12:09:40.158590958Z",
    "tags": null
  },
  "/notes/intro-to-git": {
    "title": "Intro to git",
    "content": "# Git Meeting Notes\n\n## Introduction\n\nHi my name is Austin, I am the new VP of the club. I am really excited to be able to participate and hopefully we can all have some fun and learn fun things about tech related topics together. \n\nBefore I get started with the demo on git I was hoping to talk some about bi-weekly meetings on off weeks for the club. We are hoping to get members more engaged by doing coding problems together on CodeWars or LeetCode. Maybe we will even meet in person on campus and pitch in to order pizza if everyone is up for it. \n\nI put a survey in the general chat on the discord to see what the best times were for everyone. Right now it looks like Fridays from 3 - 5 are the best times. If you are interested and didn’t see the survey before, I’ll go ahead and put the link for the survey in the chat here so you can still take it. I will finalize the times by the end of the week and hopefully we can have our first meeting next week if everything lines up.\n\n\n## Git is a version control system\n\n### What is a VCS (Version Control System)\n\n- How code changes are tracked and shared between developers\n- Two types: Central Version Control and Distributed Version Control\n\t- Central is located in one place\n\t\t- Check out, make changes, then check in\n\t\t- If server is offline or you are working somewhere without a connection then you can only see what you have ‘checked out’ so there is limited access\n\t\t- If something happens to the central repository then you have to hope there is a backup of that code somewhere\n\t- Distributed (GIT)\n\t\t- Everyone working on the code has their own local repository\n\t\t- There is the option to have a remote repository\n\t\t- Local has the same information as remote based on the last sync\n\t\t- You can see all of the changes that happened since the last backup\n\t\t- It is “Distributed” because there are multiple repositories distributed across developers\n\n### Difference between Git and GitHub\n\n- Git\n\t- Distributed VCS\n\t- Git is a version control tool used for developers to share code\n\t- Git is singularly focused - all it does is version control\n- GitHub\n\t- Cloud based platform built around the git tool\n\t- Hosts code\n\t- Provides numerous other features\n\t\t- Forking (create a copy of code that you manage)\n\t\t- SSH (secure shell) connection\n\t\t\t- SSH is a network protocol that gives users a secure way to access a computer over an unsecured network\n\t\t- Branch Protection\n\t\t- Project Insights\n\t\t- Online editing of files\n\n#### Why to use the command line\n\t\n- GUIs can only do so much and there are circumstances where you can get stuck without understanding the command line prompts\n\n#### How to download GIT - (Walkthrough)\n- Go to: https://git-scm.com/ \n- Click Downloads\n- Select OS\n- Select Version\n\n#### BASH(Bourne-Again Shell) commands - Cheat Sheet: https://www.educative.io/blog/bash-shell-command-cheat-sheet\n- ls - list directory contents\n- cd - change directory\n- pwd - print working directory\n\n#### Git commands\n- Check version\n\t- git --version\n- First time setup\n\t- git config --global user.name “YourName”\n\t- git config --global user.email “yourName@gmail.com”\n- List config\n\t- git config --list\n- Need Help?\n\t- git (command) --help\n\t- git help (command)\n- Initialize a repository - (demo with /eclipse-workspace/DemoProject)\n\t- git init\n\t- ls -la (see all files in directory using long format)\n- Check the status of the repository\n\t- git status\n- Creating .gitignore\n\t- touch .gitignore\n\t- open .gitignore in text editor\n\t- Add files or directories you want git not to track\n\t\t- bin\n\t\t- .settings\n\t\t- .project\n\t- git status again\n- Add files to staging area\n\t- git add (file / files)\n\t- git add .gitignore\n\t- git add -A or git add .\n- Remove files from staging area\n\t- git reset (file / files)\n\t- git reset \n- Committing files to the repository\n\t- git add -A\n\t- git commit -m “Initial Commit”\n- Seeing Changes\n\t- git diff\n- Checking the repository log\n\t- git log\n\t- Returns a log of commits with their comments\n\n### Interacting with GitHub\n\n#### Setting up SSH on GitHub: https://www.geeksforgeeks.org/using-github-with-ssh-secure-shell/\n- Creating SSH Key\n\t- ssh-keygen -t rsa -b 4096 -C \"your_email@example.com\"\n\t- Enter to use default\n\t- Type passphrase\n\t- ls -al ~/.ssh (verify rsa creation)\n- Adding SSH Key to agent\n\t- eval \"$(ssh-agent -s)\"\n\t- ssh-add ~/.ssh/id_rsa\n- Add SSH key to github\n\t- clip \u003c ~/.ssh/id_rsa.pub (copy to clipboard)\n\t- Add to github using settings under profile\n- Test SSH connection\n\t- ssh -T git@github.com\n\n#### Creating a remote repository on GitHub\n- Click new use name “DemoProject” on GitHub\n\t- echo \"# DemoProject\" \u003e\u003e README.md\n\t- git init\n\t- git add README.md\n\t- git commit -m \"first commit\"\n\t- git branch -M main\n\t- git remote add origin git@github.com:AustinFinell/DemoProject.git\n\t- git push -u origin main\n \n- Pushing to a repository (push your changes to the master branch)\n\t- git push \u003curl\u003e \n\n- Pulling from a repository (pull other changes before pushing in order to normalize changes made by other devs)\n\t- git pull \u003curl\u003e\n\n- Cloning a remote repository\n\t- git clone \u003curl\u003e \u003cwhere to clone\u003e\n\t- git clone https://github.com/AustinFinell/TicTacToe/ .\n\n- Branching (more common workflow) Image: https://www.nobledesktop.com/image/blog/git-branches-merge.png\n\t- git branch “name” (creates a new branch)\n\t- git branch (returns all branch names)\n\t- git checkout “name” (change to that branch)\n\t- Commit changes to local new branch\n\t- git push -u \u003curl\u003e \u003cbranch name\u003e (push to remote before merging)\n\n- Merging to master branch\n\t- git checkout main (could also be master)\n\t- git pull \u003curl\u003e master(any changes from master branch)\n\t- git branch --merged (see which branches have been merged)\n\t- git merge “feature-branch”\n\t- git push \u003curl\u003e master (push changes to master branch)\n\n- Deleting used branches\n\t- git branch --merged\n\t- git branch -d “name”\n\t- git branch -a (check branches)\n\t- git push \u003curl\u003e --delete “name”\n\n- Pull Requests\n\t- Finished your commits in a new branch in local repository\n\t- Your code needs to be checked by someone else in the remote repository before merging\n\t- Push new branch up to the remote repository (GitHub)\n\t- Create a pull request on that repository (GitHub)\n\t- The idea is you are pulling the new branch into the master branch.\n\t- This allows the merge to be checked off by whoever controls the repository. If they do, they will accept the pull request.",
    "lastmodified": "2022-09-01T12:09:40.190591198Z",
    "tags": null
  },
  "/notes/personal-privacy-and-security": {
    "title": "Personal Privacy and Security",
    "content": "---\n## Why does it matter?\n### From [privacyguides.org](https://privacyguides.org):\n#### “I have nothing to hide. Why should I care about my privacy?”\n\n Much like the right to interracial marriage, woman's suffrage, freedom of speech, and many others, we didn't always have the right to privacy. In several dictatorships, many still don't. Generations before ours fought for our right to privacy. Privacy is a human right inherent to all of us that we are entitled to without discrimination.\n\n You shouldn't confuse privacy with secrecy. We know what happens in the bathroom, but you still close the door. That's because you want privacy, not secrecy. **Everyone** has something to hide, privacy is something that makes you human.\n\n### Some food for thought:\n\u003e You might not have anything to hide, but you have everything to protect.\n\n-Mikko Hyppönen\n\n\u003e Arguing that you don't care about the right to privacy because you have nothing to hide is no different than saying you don't care about free speech because you have nothing to say.\n\n-Edward Snowden\n\n### What do you have to protect?\nLocation data, medical records, credit card, pictures, notes, emails.....\n\nstalking could be a personal concern, government surviellence like ECHELON, FinCEN, [NSA Utah Data Center](https://en.wikipedia.org/wiki/Utah_Data_Center), companies can sell anything you give to them...\n\n![NSA Utah Data Center](/notes/images/Pastedimage20220302145304.png)\n\n## What is security and privacy?\nSecurity is about keeping unauthorized entities out (of your information), privacy is about who those people are.\n\n![Security vs Privacy infographic](/notes/images/securityVsPrivacy.png)\n## What is a threat model?\nA threat model identifies threats and defines countermeasures.\n\nA threat model is:\n- personal\n- not a black and white \"you are secure vs not secure\"\n- slow progress\n\nEveryone already does threat modeling, they just don't know there is a name for it or they're not aware that they're doing it.\n\nThreat modeling is not just for your digital assets, take this automotive threat model for example:\n![Pasted image 20220302161742.png](/notes/images/automotiveThreatModel.png)\n\u003cfigcaption\u003e\u003ca href=\"https://www.nccgroup.com/globalassets/newsroom/uk/blog/images/2016/07/th-cc-11.png\"\u003eSource\u003c/a\u003e\u003c/figcaption\u003e\n\n### From [ArsTechnica](https://arstechnica.com/information-technology/2017/07/how-i-learned-to-stop-worrying-mostly-and-love-my-threat-model/):\nTo identify what could happen to the things you value and determine from whom you need to protect them, you want to answer these five questions:\n\n1.  What do you want to protect? (The data, communications, and other things that could cause problems for you if misused.)\n2.  Who do you want to protect it from? (The people, organizations, and criminal actors who might seek access to that stuff.)\n3.  How likely is it that you will need to protect it? (Your personal level of exposure to those threats.)\n4.  How bad are the consequences if you fail?\n5.  How much trouble are you willing to go through in order to try to prevent those? (The money, time and convenience you're willing to dispense with to protect those things.)\n...\nOf course, some activities invite risk in and of themselves based on the kind of information being exposed. In the world of threat modeling, these are often referred to as \"**assets**\"—the important pieces of information you want to use in an activity but simultaneously want to protect:\n\n-   Credit card data: yours, or (if you sell stuff) a customer's.\n-   Banking data: account numbers, routing numbers, e-banking usernames and passwords.\n-   Personally identifying information: Social Security number, date of birth, income data, W-2s, passport numbers, drivers' license or national ID numbers.\n-   Intellectual property: like that treatment for an Ars action movie I've been working on.\n-   Sensitive personal or business information and communications: e-mails and texts that could be used to embarrass, blackmail, or imprison you.\n-   Politically sensitive information or activities that could get you in trouble with your employer, the government, law enforcement, or other interested parties.\n-   Travel plans that could be used to target you or others for fraud or other forms of attack.\n-   Other business or personal data that are financially or emotionally essential (family digital photos, for example).\n-   Your identity itself, if you are trying to stay anonymous online for your protection.\n\n### A basic threat model\nHere's a simple table to help you. Give each cell a value from 1-3 for importance, and a brief (5-10 words) description of your stance/concerns.\n\n|           | People | Companies | Governments |\n|",
    "lastmodified": "2022-09-01T12:09:40.190591198Z",
    "tags": null
  },
  "/notes/ssh": {
    "title": "SSH",
    "content": "Join the club discord:\n[urlsl.me/ClubDiscord](https://urlsl.me/ClubDiscord)\n## What is SSH?\nSecure SHell, because many protocols at the time of inception were unsecure. Nowadays, the most popular SSH implementation by far is OpenSSH. Basically, its main function is to provide secure, remote terminal access.\n## [SSH Uses](https://phoenixnap.com/kb/what-is-ssh)\n\u003e These scenarios include:\n\u003e - Connecting to a [remote host](https://phoenixnap.com/blog/secure-remote-access-best-practices).\n\u003e - Backing up, copying, and mirroring files using SFTP.\n\u003e - [Mapping a client's port to the server's port](https://phoenixnap.com/kb/ssh-port-forwarding) to secure TCP/IP and other network protocols.\n\u003e - Forwarding X Window System from the server to clients.\n\u003e - Tunneling sensitive data through a secure channel.\n\u003e - Using a Virtual Private Network.\n\nWe will focus on remote shell, tunneling and file transfer.\n## OpenSSH News\n[OpenSSH 9 released last week.](https://www.linuxadictos.com/en/openssh-9-0-arrives-with-sftp-instead-of-scp-improvements-and-more.html)\nThe scp utility now uses sftp instead of the less secure scp/rcp protocol.\nForward-thinking authentication and encryption methods enable \"quantum-resistant\" protections.\n## Remote shell\n### The Server\nThe config is typically in `/etc/ssh/sshd_config`. Edit with superuser.\nLook up \"SSH hardening\". This should give you some good ideas for what to manipulate here. [Here's](https://node-security.com/posts/ssh-server-hardening/) a decent page about it. \n[This](https://www.ssh.com/academy/ssh/sshd_config) webpage has a nearly exhaustive list of options\n### The Client\nHere's a basic ssh connection command:\n`ssh student@ssh.csclub.xyz`\nIt will ask you for a password and you can then login.\nBut there are better authentication methods!\n\n#### ssh-keygen\nThere is this concept of using cryptographic keys for authentication instead of passwords. There are many benefits to this some of which are discussed [here](https://security.stackexchange.com/questions/69407/why-is-using-an-ssh-key-more-secure-than-using-passwords). I will put in my 2 cents and say that they also enable strict permissions and managing multiple authorized users via the `authorized_keys` file.\n\nAn example is if a sysadmin leaves an organization, and all the other sysadmins were using the same user on every machine for simplicity. Then you only have to remove the key instead of worrying about resetting passwords everywhere.\nAnother example is ssh tunnels, where you can specify a connection is not allowed shell access and only allowed certain ports.\n\nTo generate keys use the `ssh-keygen` command. It has many options, but for most uses the defaults and onscreen prompts are fine.\nThen, copy your new key with the `ssh-copy-id` command (and disable password authentication server side). You can instead copy over your key (`keyname.pub`) on a newline manually into `~/.ssh/authorized_keys` if you know what you're doing.\n\nThere are many types of keys including some cool ones like those appended with `-sk` (for \"Security Key\") and some OpenPGP-based options.\n\n#### Config\nClient config is typically in `~/.ssh/config`. This makes it easier to connect with a shorthand instead of remembering all your options:\n```\nHost csclub\n        HostName ssh.csclub.xyz\n        User student\n        Port 22\n        IdentityFile ~/.ssh/id_rsa\n```\nNow you can use `ssh csclub`.\n\n## File copy\nConnect with sftp:\n`sftp user@host`\nThe basic commands in sftp are:\n- *lcd* change local directory\n- *cd* change remote directory\n- *get* download remote file\n- *put* upload remote file\nYou can find more commands with `help`.\nThe best way to transfer entire directories is just to tar and zip, then grab that file instead of messing with directory structures and such.\n## SSH tunneling\nI didn't have time to prepare this so [here's a webpage](https://www.ssh.com/academy/ssh/tunneling). I'll demonstrate it at the meeting.",
    "lastmodified": "2022-09-01T12:09:40.190591198Z",
    "tags": null
  }
}